mymy49/yss/inc/targets/st_gigadevice/define_gpio_stm32f0_f4_f7_g4.h
	PG14_SPI6_MOSI = 5,
	PG14_USART6_TX = 8,
	PG14_ETH_MII_TXD1 = 11,
	PG14_ETH_RMII_TXD1 = 11,
	PG14_FMC_A25 = 12,
	PG14_EVENTOUT = 15,

	PG15_USART6_CTS = 8,
	PG15_FMC_SDNCAS = 12,
	PG15_DCMI_D13 = 13,
	PG15_EVENTOUT = 15,

	PH0_EVENTOUT = 15,

	PH1_EVENTOUT = 15,

	PH2_ETH_MII_CRS = 11,
	PH2_FMC_SDCKE0 = 12,
	PH2_LCD_R0 = 14,
	PH2_EVENTOUT = 15,

	PH3_ETH_MII_COL = 11,
	PH3_FMC_SDNE0 = 12,
	PH3_LCD_R1 = 14,
	PH3_EVENTOUT = 15,
	
	PH4_I2C2_SCL = 4,
	PH4_OTG_HS_ULPI_NXT = 10,
	PH4_EVENTOUT = 15,

	PH5_I2C2_SDA = 4,
	PH5_SPI5_NSS = 5,
	PH5_FMC_SDNWE = 12,
	PH5_EVENTOUT = 15,

	PH6_I2C2_SMBA = 4,
	PH6_SPI5_SCK = 5,
	PH6_TIM12_CH1 = 9,
	PH6_FMC_SDNE1 = 12,
	PH6_DCMI_D8 = 13,

	PH7_I2C3_SCL = 4,
	PH7_SPI5_MISO = 5,
	PH7_ETH_MII_RXD3 = 11,
	PH7_SDCKE1 = 12,
	PH7_DCMI_D9 = 13,

	PH8_I2C3_SDA = 4,
	PH8_FMC_D16 = 12,
	PH8_DCMI_HSYNC = 13,
	PH8_LCD_R2 = 14,
	PH8_EVENTOUT = 15,

	PH9_I2C3_SMBA = 4,
	PH9_TIM12_CH2 = 9,
	PH9_FMC_D17 = 12,
	PH9_DCMI_D0 = 13,
	PH9_LCD_R3 = 14,
	PH9_EVENTOUT = 15,

	PH10_TIM5_CH1 = 2,
	PH10_FMC_D18 = 12,
	PH10_DCMI_D1 = 13,
	PH10_LCD_R4 = 14,
	PH10_EVENTOUT = 15,

	PH11_TIM5_CH2 = 2,
	PH11_FMC_D19 = 12,
	PH11_DCMI_D2 = 13,
	PH11_LCD_R5 = 14,
	PH11_EVENTOUT = 15,

	PH12_TIM5_CH3 = 2,
	PH12_FMC_D20 = 12,
	PH12_DCMI_D3 = 13,
	PH12_LCD_R6 = 14,
	PH12_EVENTOUT = 15,

	PH13_TIM8_CH1N = 3,
	PH13_CAN1_TX = 9,
	PH13_FMC_D21 = 12,
	PH13_LCD_G2 = 14,
	PH13_EVENTOUT = 15,

	PH14_TIM8_CH2N = 3,
	PH14_FMC_D22 = 12,
	PH14_DCMI_D4 = 13,
	PH14_LCD_G3 = 14,
	PH14_EVENTOUT = 15,

	PH15_TIM8_CH3N = 3,
	PH15_FMC_D23 = 12,
	PH15_DCMI_D11 = 13,
	PH15_LCD_G4 = 14,
	PH15_EVENTOUT = 15,

	PI0_TIM5_CH4 = 2,
	PI0_SPI2_NSS = 5,
	PI0_I2S2_WS = 5,
	PI0_FMC_D24 = 12,
	PI0_DCMI_D13 = 13,
	PI0_LCD_G5 = 14,
	PI0_EVENTOUT = 15,

	PI1_SPI2_SCK = 5,
	PI1_I2S2_CK = 5,
	PI1_FMC_D25 = 12,
	PI1_DCMI_D8 = 13,
	PI1_LCD_G6 = 14,
	PI1_EVENTOUT = 15,

	PI2_TIM8_CH4 = 3,
	PI2_SPI2_MISO = 5,
	PI2_I2S2_EXT_SD = 6,
	PI2_FMC_D26 = 12,
	PI2_DCMI_D9 = 13,
	PI2_LCD_G7 = 14,
	PI2_EVENTOUT = 15,

	PI3_TIM8_ETR = 3,
	PI3_SPI2_MOSI = 5,
	PI3_I2S2_SD = 5,
	PI3_FCM_D27 = 12,
	PI3_DCMI_D10 = 13,
	PI3_EVENTOUT = 15,

	PI4_TIM8_BKIN = 3,
	PI4_FMC_NBL2 = 12,
	PI4_DCMI_D5 = 13,
	PI4_LCD_B4 = 14,
	PI4_EVENTOUT = 15,

	PI5_TIM8_CH1 = 3,
	PI5_FMC_NBL3 = 12,
	PI5_DCMI_VSYNC = 13,
	PI5_LCD_B5 = 14,
	PI5_EVENTOUT = 15,

	PI6_TIM8_CH2 = 3,
	PI6_FMC_D28 = 12,
	PI6_DCMI_D6 = 13,
	PI6_LCD_B6 = 14,
	PI6_EVENTOUT = 15,

	PI7_TIM8_CH3 = 3,
	PI7_FMC_D29 = 12,
	PI7_DCMI_D7 = 13,
	PI7_LCD_B7 = 14,
	PI7_EVENTOUT = 15,

	PI8_EVENTOUT = 15,

	PI9_CAN1_RX = 9,
	PI9_FMC_D30 = 12,
	PI9_LCD_VSYNC = 14,
	PI9_EVENTOUT = 15,


	PI10_ETH_MII_RX_ER = 11,
	PI10_FMC_D31 = 12,
	PI10_LCD_HSYNC = 14,
	PI10_EVENTOUT = 15,

	PI11_OTG_HS_ULPI_DIR = 10,
	PI11_EVENTOUT = 15,

	PI12_LCD_HSYNC = 14,
	PI12_EVENTOUT = 15,

	PI13_LCD_VSYNC = 14,
	PI13_EVENTOUT = 15,

	PI14_LCD_CLK = 14,
	PI14_EVENTOUT = 15,

	PI15_LCD_R0 = 14,
	PI15_EVENTOUT = 15,

	PJ0_LCD_R1 = 14,
	PJ0_EVENTOUT = 15,

	PJ1_LCD_R2 = 14,
	PJ1_EVENTOUT = 15,

	PJ2_LCD_R3 = 14,
	PJ2_EVENTOUT = 15,

	PJ3_LCD_R4 = 14,
	PJ3_EVENTOUT = 15,

	PJ4_LCD_R5 = 14,
	PJ4_EVENTOUT = 15,

	PJ5_LCD_R6 = 14,
	PJ5_EVENTOUT = 15,

	PJ6_LCD_R7 = 14,
	PJ6_EVENTOUT = 15,

	PJ7_LCD_G0 = 14,
	PJ7_EVENTOUT = 15,

	PJ8_LCD_G1 = 14,
	PJ8_EVENTOUT = 15,

	PJ9_LCD_G2 = 14,
	PJ9_EVENTOUT = 15,

	PJ10_LCD_G3 = 14,
	PJ10_EVENTOUT = 15,

	PJ11_LCD_G4 = 14,
	PJ11_EVENTOUT = 15,

	PJ12_LCD_B0 = 14,
	PJ12_EVENTOUT = 15,

	PJ13_LCD_B1 = 14,
	PJ13_EVENTOUT = 15,

	PJ14_LCD_B2 = 14,
	PJ14_EVENTOUT = 15,

	PJ15_LCD_B3 = 14,
	PJ15_EVENTOUT = 15,

	PK0_LCD_G5 = 14,
	PK0_EVENTOUT = 15,

	PK1_LCD_G6 = 14,
	PK1_EVENTOUT = 15,

	PK2_LCD_G7 = 14,
	PK2_EVENTOUT = 15,

	PK3_LCD_B4 = 14,
	PK3_EVENTOUT = 15,

	PK4_LCD_B5 = 14,
	PK4_EVENTOUT = 15,

	PK5_LCD_B6 = 14,
	PK5_EVENTOUT = 15,

	PK6_LCD_B7 = 14,
	PK6_EVENTOUT = 15,

	PK7_LCD_DE = 14,
	PK7_EVENTOUT = 15,
};

#elif defined(STM32F7)
enum
{
	PA0_TIM2_CH1 = 1,
	PA0_TIM2_ETR = 1,
	PA0_TIM5_CH1 = 2,
	PA0_TIM8_ETR = 3,
	PA0_USART2_CTS = 7,
	PA0_UART4_TX = 8,
	PA0_SAI2_SD_B = 10,
	PA0_ETH_MII_CRS = 11,
	PA0_EVENTOUT = 15,

	PA1_TIM2_CH2 = 1,
	PA1_TIM5_CH2 = 2,
	PA1_USART2_RTS = 7,
	PA1_UART4_RX = 8,
	PA1_QUADSPI_BK1_IO3 = 9,
	PA1_SAI2_MCK_B = 10,
	PA1_ETH_MII_RX_CLK = 11,
	PA1_ETH_RMII_REF_CLK = 11,
	PA1_LCD_R2 = 14,
	PA1_EVENTOUT = 15,

	PA2_TIM2_CH3 = 1,
	PA2_TIM5_CH3 = 2,
	PA2_TIM9_CH1 = 3,
	PA2_USART2_TX = 7,
	PA2_SAI2_SCK_B = 8,
	PA2_ETH_MDIO = 11,
	PA2_LCD_R1 = 14,
	PA2_EVENTOUT = 15,

	PA3_TIM2_CH4 = 1,
	PA3_TIM5_CH4 = 2,
	PA3_TIM9_CH2 = 3,
	PA3_USART2_RX = 7,
	PA3_OTG_HS_ULPI_D0 = 10,
	PA3_ETH_MII_COL = 11,
	PA3_LCD_B5 = 14,
	PA3_EVENTOUT = 15,
	
	PA4_SPI1_NSS = 5,
	PA4_I2S1_WS = 5,
	PA4_SPI3_NSS = 6,
	PA4_I2S3_WS = 6,
	PA4_USART2_CK = 7,
	PA4_OTG_HS_SOF = 12,
	PA4_DCMI_HSYNC = 13,
	PA4_LCD_VSYNC = 14,
	PA4_EVENTOUT = 15,
	
	PA5_TIM2_CH1 = 1,
	PA5_TIM2_ETR = 1,
	PA5_TIM8_CH1N = 3,
	PA5_SPI1_SCK = 5,
	PA5_I2S1_CK = 5,
	PA5_OTG_HS_ULPI_CK = 10,
	PA5_LCD_R4 = 14,
	PA5_EVENTOUT = 15,

	PA6_TIM1_BKIN = 1,
	PA6_TIM3_CH1 = 2,
	PA6_TIM8_BKIN = 3,
	PA6_SPI1_MISO = 5,
	PA6_TIM13_CH1 = 9,
	PA6_DCMI_PIXCLK = 13,
	PA6_LCD_G2 = 14,
	PA6_EVENTOUT = 15,

	PA7_TIM1_CH1N = 1,
	PA7_TIM3_CH2 = 2,
	PA7_TIM8_CH1N = 3,
	PA7_SPI1_MOSI = 5,
	PA7_I2S1_SD = 5,
	PA7_TIM14_CH1 = 9,
	PA7_ETH_MII_RX_DV = 11,
	PA7_ETH_RMII_CRS_DV = 11,
	PA7_FMC_SD_NWE = 12,
	PA7_EVENTOUT = 15,

	PA8_MCO1 = 0,
	PA8_TIM1_CH1 = 1,
	PA8_TIM8_BKIN2 = 3,
	PA8_I2C3_SCL = 4,
	PA8_USART1_CK = 7,
	PA8_OTG_FS_SOF = 10,
	PA8_LCD_R6 = 14,
	PA8_EVENTOUT = 15,

	PA9_TIM1_CH2 = 1,
	PA9_I2C3_SMBA = 4,
	PA9_SPI2_SCK = 5,
	PA9_I2S2_CK = 5,
	PA9_USART1_TX = 7,
	PA9_DCMI_D0 = 13,
	PA9_EVENTOUT = 15,

	PA10_TIM1_CH3 = 1,
	PA10_USART1_RX = 7,
	PA10_OTG_FS_ID = 10,
	PA10_DCMI_D1 = 13,
	PA10_EVENTOUT = 15,

	PA11_TIM1_CH4 = 1,
	PA11_USART1_CTS = 7,
	PA11_CAN1_RX = 9,
	PA11_OTG_FS_DM = 10,
	PA11_LCD_R4 = 14,
	PA11_EVENTOUT = 15,

	PA12_TIM1_ETR = 1,
	PA12_USART1_RTS = 7,
	PA12_SAI2_FS_B = 8,
	PA12_CAN1_TX = 9,
	PA12_OTG_FS_DP = 10,
	PA12_LCD_R5 = 14,
	PA12_EVENTOUT = 15,

	PA13_JTMS = 0,
	PA13_SWDIO = 0,
	PA13_EVENTOUT = 15,

	PA14_JTCK = 0,
	PA14_SWCLK = 0,
	PA14_EVENTOUT = 15,

	PA15_JTDI = 0,
	PA15_TIM2_CH1 = 1,
	PA15_TIM2_ETR = 1,
	PA15_HDMI_CEC = 4,
	PA15_SPI1_NSS = 5,
	PA15_I2S1_WS = 5,
	PA15_SPI3_NSS = 6,
	PA15_I2S3_WS = 6,
	PA15_UART4_RTS = 8,
	PA15_EVENTOUT = 15,

