mymy49/yss/inc/targets/st_gigadevice/define_gpio_stm32f0_f4_f7_g4.h
	PB0_TIM1_CH2N = 1,
	PB0_TIM3_CH3 = 2,
	PB0_TIM8_CH2N = 3,
	PB0_UART4_CTS = 8,
	PB0_LCD_R3 = 9,
	PB0_OTG_HS_ULPI_D1 = 10,
	PB0_ETH_MII_RXD2 = 11,
	PB0_EVENTOUT = 15,

	PB1_TIM1_CH3N = 1,
	PB1_TIM3_CH4 = 2,
	PB1_TIM8_CH3N = 3,
	PB1_LCD_R6 = 9,
	PB1_OTG_HS_ULPI_D2 = 10,
	PB1_ETH_MII_RXD3 = 11,
	PB1_EVENTOUT = 15,

	PB2_SAI1_SD_A = 6,
	PB2_SPI3_MOSI = 7,
	PB2_I2S3_SD = 8,
	PB2_QUADSPI_CLK = 9,
	PB2_EVENTOUT = 15,

	PB3_JTDO = 0,
	PB3_TRACESWO = 0,
	PB3_TIM2_CH2 = 1,
	PB3_SPI1_SCK = 5,
	PB3_I2S1_CK = 5,
	PB3_SPI3_SCK = 6,
	PB3_I2S3_CK = 6,
	PB3_EVENTOUT = 15,

	PB4_NJTRST = 0,
	PB4_TIM3_CH1 = 2,
	PB4_SPI1_MISO = 5,
	PB4_SPI3_MISO = 6,
	PB4_SPI2_NSS = 7,
	PB4_I2S2_WS = 7,
	PB4_EVENTOUT = 15,

	PB5_TIM3_CH2 = 2,
	PB5_I2C1_SMBA = 4,
	PB5_SPI1_MOSI = 5,
	PB5_I2S1_SD = 5,
	PB5_SPI3_MOSI = 6,
	PB5_I2S3_SD = 6,
	PB5_CAN2_RX = 9,
	PB5_OTG_HS_ULPI_D7 = 10,
	PB5_ETH_PPS_OUT = 11,
	PB5_FMC_SDCKE1 = 12,
	PB5_DCMI_D10 = 13,
	PB5_EVENTOUT = 15,

	PB6_TIM4_CH1 = 2,
	PB6_HDMI_CEC = 3,
	PB6_I2C1_SCL = 4,
	PB6_USART1_TX = 7,
	PB6_CAN2_TX = 9,
	PB6_QUADSPI_BK1_NCS = 10,
	PB6_FMC_SDNE1 = 12,
	PB6_DCMI_D5 = 13,
	PB6_EVENTOUT = 15,

	PB7_TIM4_CH2 = 2,
	PB7_I2C1_SDA = 4,
	PB7_USART1_RX = 7,
	PB7_FMC_NL = 12,
	PB7_DCMI_VSYNC = 13,
	PB7_EVENTOUT = 15,

	PB8_TIM4_CH3 = 2,
	PB8_TIM10_CH1 = 3,
	PB8_I2C1_SCL = 4,
	PB8_CAN1_RX = 9,
	PB8_ETH_MII_TXD3 = 11,
	PB8_SDIO_D4 = 12,
	PB8_DCMI_D6 = 13,
	PB8_LCD_B6 = 14,
	PB8_EVENTOUT = 15,

	PB9_TIM4_CH4 = 2,
	PB9_TIM11_CH1 = 3,
	PB9_I2C1_SDA = 4,
	PB9_SPI2_NSS = 5,
	PB9_I2S2_WS = 5,
	PB9_CAN1_TX = 9,
	PB9_SDMMC1_D5 = 12,
	PB9_DCMI_D7 = 13,
	PB9_LCD_B7 = 14,
	PB9_EVENTOUT = 15,

	PB10_TIM2_CH3 = 1,
	PB10_I2C2_SCL = 4,
	PB10_SPI2_SCK = 5,
	PB10_I2S2_CK = 5,
	PB10_USART3_TX = 7,
	PB10_OTG_HS_ULPI_D3 = 10,
	PB10_ETH_MII_RX_ER = 11,
	PB10_LCD_G4 = 14,
	PB10_EVENTOUT = 15,

	PB11_TIM2_CH4 = 1,
	PB11_I2C2_SDA = 4,
	PB11_USART3_RX = 7,
	PB11_OTG_HS_ULPI_D4 = 10,
	PB11_ETH_MII_TX_EN = 11,
	PB11_ETH_RMII_TX_EN = 11,
	PB11_LCD_G5 = 14,
	PB11_EVENTOUT = 15,

	PB12_TIM1_BKIN = 1,
	PB12_I2C2_SMBA = 4,
	PB12_SPI2_NSS = 5,
	PB12_I2S2_WS = 5,
	PB12_USART3_CK = 7,
	PB12_CAN2_RX = 9,
	PB12_OTG_HSULPI_D5 = 10,
	PB12_ETH_MII_TXD0 = 11,
	PB12_ETH_RMII_TXD0 = 11,
	PB12_OTG_HS_ID = 12,
	PB12_EVENTOUT = 15,

	PB13_TIM1_CH1N = 1,
	PB13_SPI2_SCK = 5,
	PB13_I2S2_CK = 5,
	PB13_USART3_CTS = 7,
	PB13_CAN2_TX = 9,
	PB13_OTG_HS_ULPI_D6 = 10,
	PB13_ETH_MII_TXD1 = 11,
	PB13_ETH_RMII_TXD1 = 11,
	PB13_EVENTOUT = 15,

	PB14_TIM1_CH2N = 1,
	PB14_TIM8_CH2N = 3,
	PB14_SPI2_MISO = 5,
	PB14_USART3_RTS = 7,
	PB14_TIM12_CH1 = 9,
	PB14_OTG_HS_DM = 12,
	PB14_EVENTOUT = 15,

	PB15_RTC_REFIN = 0,
	PB15_TIM1_CH3N = 1,
	PB15_TIM8_CH3N = 3,
	PB15_SPI2_MOSI = 5,
	PB15_I2S2_SD = 5,
	PB15_TIM12_CH2 = 9,
	PB15_OTG_HS_DP = 12,
	PB15_EVENTOUT = 15,

	PC0_SAI2_FS_B = 8,
	PC0_OTG_HS_ULPI_STP = 10,
	PC0_FMC_SDNWE = 12,
	PC0_LCD_R5 = 14,
	PC0_EVENTOUT = 15,
	
	PC1_TRACED0 = 0,
	PC1_SPI2_MOSI = 5,
	PC1_I2S2_SD = 5,
	PC1_SAI1_SD_A = 6,
	PC1_ETH_MDC = 11,
	PC1_EVENTOUT = 15,
	
	PC2_SPI2_MISO = 5,
	PC2_OTG_HS_ULPI_DIR = 10,
	PC2_ETH_MII_TXD2 = 11,
	PC2_FMC_SDNE0 = 12,
	PC2_EVENTOUT = 15,

	PC3_SPI2_MOSI = 5,
	PC3_I2S2_SD = 5,
	PC3_OTG_HS_ULPI_NXT = 10,
	PC3_ETH_MII_TX_CLK = 11,
	PC3_FMC_SDCKE0 = 12,
	PC3_EVENTOUT = 15,

	PC4_I2S1_MCK = 5,
	PC4_SPDIFRX_IN2 = 8,
	PC4_ETH_MII_RXD0 = 11,
	PC4_ETH_RMII_RXD0 = 11,
	PC4_FMC_SDNE0 = 12,
	PC4_EVENTOUT = 15,

	PC5_SPDIFRX_IN3 = 8,
	PC5_ETH_MII_RXD1 = 11,
	PC5_ETH_RMII_RXD1 = 11,
	PC5_FMC_SDCKE0 = 12,
	PC5_EVENTOUT = 15,

	PC6_TIM3_CH1 = 2,
	PC6_TIM8_CH1 = 3,
	PC6_I2S2_MCK = 5,
	PC6_USART6_TX = 8,
	PC6_SDMMC1_D6 = 12,
	PC6_DCMI_D0 = 13,
	PC6_LCD_HSYNC = 14,
	PC6_EVENTOUT = 15,

	PC7_TIM3_CH2 = 2,
	PC7_TIM8_CH2 = 3,
	PC7_I2S3_MCK = 6,
	PC7_USART6_RX = 8,
	PC7_SDMMC1_D7 = 12,
	PC7_DCMI_D1 = 13,
	PC7_LCD_G6 = 14,
	PC7_EVENTOUT = 15,

	PC8_TRACED1 = 0,
	PC8_TIM3_CH3 = 2,
	PC8_TIM8_CH3 = 3,
	PC8_UART5_RTS = 7,
	PC8_USART6_CK = 8,
	PC8_SDMMC1_D0 = 12,
	PC8_DCMI_D2 = 13,
	PC8_EVENTOUT = 15,

	PC9_MCO2 = 0,
	PC9_TIM3_CH4 = 2,
	PC9_TIM8_CH4 = 3,
	PC9_I2C3_SDA = 4,
	PC9_I2S_CKIN = 5,
	PC9_UART5_CTS = 7,
	PC9_QUADSPI_BK1_IO0 = 9,
	PC9_SDMMC1_D1 = 12,
	PC9_DCMI_D3 = 13,
	PC9_EVENTOUT = 15,

	PC10_SPI3_SCK = 6,
	PC10_I2S3_CK = 6,
	PC10_USART3_TX = 7,
	PC10_UART4_TX = 8,
	PC10_QUADSPI_BK1_IO1 = 9,
	PC10_SDMMC1_D2 = 12,
	PC10_DCMI_D8 = 13,
	PC10_LCD_R2 = 14,
	PC10_EVENTOUT = 15,

	PC11_SPI3_MISO = 6,
	PC11_USART3_RX = 7,
	PC11_UART4_RX = 8,
	PC11_QUADSPI_BK2_NCS = 9,
	PC11_SDMMC1_D3 = 12,
	PC11_DCMI_D4 = 13,
	PC11_EVENTOUT = 15,

	PC12_TRACED3 = 0,
	PC12_SPI3_MOSI = 6,
	PC12_I2S3_SD = 6,
	PC12_USART3_CK = 7,
	PC12_UART5_TX = 8,
	PC12_SDMMC1_CK = 12,
	PC12_DCMI_D9 = 13,
	PC12_EVENTOUT = 15,

	PC13_EVENTOUT = 15,

	PC14_EVENTOUT = 15,

	PC15_EVENTOUT = 15,

	PD0_CAN1_RX = 9,
	PD0_FMC_D2 = 12,
	PD0_EVENTOUT = 15,

	PD1_CAN1_TX = 9,
	PD1_FMC_D3 = 12,
	PD1_EVENTOUT = 15,

	PD2_TRACED2 = 0,
	PD2_TIM3_ETR = 2,
	PD2_UART5_RX = 8,
	PD2_SDMMC1_CMD = 12,
	PD2_DCMI_D11 = 13,
	PD2_EVENTOUT = 15,

	PD3_SPI2_SCK = 5,
	PD3_I2S2_CK = 5,
	PD3_USART2_CTS = 7,
	PD3_FMC_CLK = 12,
	PD3_DCMI_D5 = 13,
	PD3_LCD_G7 = 14,
	PD3_EVENTOUT = 15,

	PD4_USART2_RTS = 7,
	PD4_FMC_NOE = 12,
	PD4_EVENTOUT = 15,

	PD5_USART2_TX = 7,
	PD5_FMC_NWE = 12,
	PD5_EVENTOUT = 15,

	PD6_SPI3_MOSI = 5,
	PD6_I2S3_SD = 5,
	PD6_SAI1_SD_A = 6,
	PD6_USART2_RX = 7,
	PD6_FMC_NWAIT = 12,
	PD6_DCMI_D10 = 13,
	PD6_LCD_B2 = 14,
	PD6_EVENTOUT = 15,

	PD7_USART2_CK = 7,
	PD7_SPDIFRX_IN0 = 8,
	PD7_FMC_NE1 = 12,
	PD7_EVENTOUT = 15,

	PD8_USART3_TX = 7,
	PD8_SPDIFRX_IN1 = 8,
	PD8_FMC_D13 = 12,
	PD8_EVENTOUT = 15,

	PD9_USART3_RX = 7,
	PD9_FMC_D14 = 12,
	PD9_EVENTOUT = 15,

	PD10_USART3_CK = 7,
	PD10_FMC_D15 = 12,
	PD10_LCD_B3 = 14,
	PD10_EVENTOUT = 15,

	PD11_I2C4_SMBA = 4,
	PD11_USART3_CTS = 7,
	PD11_QUADSPI_BK1_IO0 = 9,
	PD11_SAI2_SD_A = 10,
	PD11_FMC_A16 = 12,
	PD11_FMC_CLE = 12,
	PD11_EVENTOUT = 15,

	PD12_TIM4_CH1 = 2,
	PD12_LPTIM1_IN1 = 3,
	PD12_I2C4_SCL = 4,
	PD12_USART3_RTS = 7,
	PD12_QUADSPI_BK1_IO1 = 9,
	PD12_SAI2_FS_A = 10,
	PD12_FMC_A17 = 12,
	PD12_FMC_ALE = 12,
	PD12_EVENTOUT = 15,

