mymy49/yss/inc/targets/st_gigadevice/define_gpio_stm32f0_f4_f7_g4.h
	PD13_TIM4_CH2 = 2,
	PD13_LPTIM1_OUT = 3,
	PD13_I2C4_SDA = 4,
	PD13_QUADSPI_BK1_IO3 = 9,
	PD13_SAI2_SCK_A = 10,
	PD13_FMC_A18 = 12,
	PD13_EVENTOUT = 15,

	PD14_TIM4_CH3 = 2,
	PD14_UART8_CTS = 8,
	PD14_FMC_D0 = 12,
	PD14_EVENTOUT = 15,

	PD15_TIM4_4 = 2,
	PD15_UART8_RTS = 8,
	PD15_FMC_D1 = 12,
	PD15_EVENTOUT = 15,

	PE0_TIM4_ETR = 2,
	PE0_LPTIM1_ETR = 3,
	PE0_UART8_RX = 8,
	PE0_SAI2_MCK_A = 10,
	PE0_FMC_NBL0 = 12,
	PE0_DCMI_D2 = 13,
	PE0_EVENTOUT = 15,

	PE1_LPTIM1_IN2 = 3,
	PE1_UART8_TX = 8,
	PE1_FMC_NBL1 = 12,
	PE1_DCMI_D3 = 13,
	PE1_EVENTOUT = 15,

	PE2_TRACECLK = 0,
	PE2_SPI4_CLK = 5,
	PE2_SAI1_MCLK_A = 6,
	PE2_ETH_MII_TXD3 = 11,
	PE2_FMC_A23 = 12,
	PE2_EVENTOUT = 15,

	PE3_TRACED0 = 0,
	PE3_SAI1_SD_B = 6,
	PE3_FMC_A19 = 12,
	PE3_EVENTOUT = 15,

	PE4_TRACED1 = 0,
	PE4_SPI4_NSS = 5,
	PE4_SAI1_FS_A = 6,
	PE4_FMC_A20 = 12,
	PE4_DCMI_D4 = 13,
	PE4_LCD_B0 = 14,
	PE4_EVENTOUT = 15,

	PE5_TRACED2 = 0,
	PE5_TIM9_CH1 = 3,
	PE5_SPI4_MISO = 5,
	PE5_SAI1_SCK_A = 6,
	PE5_FMC_A21 = 12,
	PE5_DCMI_D6 = 13,
	PE5_LCD_G0 = 14,
	PE5_EVENTOUT = 15,

	PE6_TRACED3 = 0,
	PE6_TIM9_CH2 = 3,
	PE6_SPI4_MOSI = 5,
	PE6_SAI1_SD_A = 6,
	PE6_FMC_A22 = 12,
	PE6_DCMI_D7 = 13,
	PE6_LCD_G1 = 14,
	PE6_EVENTOUT = 15,

	PE7_TIM1_ETR = 1,
	PE7_UART7_RX = 8,
	PE7_FMC_D4 = 12,
	PE7_EVENTOUT = 15,

	PE8_TIM1_CH1N = 1,
	PE8_UART7_TX = 8,
	PE8_FMC_D5 = 12,
	PE8_EVENTOUT = 15,

	PE9_TIM1_CH1 = 1,
	PE9_FMC_D6 = 12,
	PE9_EVENTOUT = 15,

	PE10_TIM1_CH2N = 1,
	PE10_FMC_D7 = 12,
	PE10_EVENTOUT = 15,

	PE11_TIM1_CH2 = 1,
	PE11_SPI4_NSS = 5,
	PE11_FMC_D8 = 12,
	PE11_LCD_G3 = 14,
	PE11_EVENTOUT = 15,

	PE12_TIM1_CH3N = 1,
	PE12_SPI4_SCK = 5,
	PE12_FMC_D9 = 12,
	PE12_LCD_B4 = 14,
	PE12_EVENTOUT = 15,

	PE13_TIM1_CH3 = 1,
	PE13_SPI4_MISO = 5,
	PE13_FMC_D10 = 12,
	PE13_LCD_DE = 14,
	PE13_EVENTOUT = 15,

	PE14_TIM1_CH4 = 1,
	PE14_SPI4_MOSI = 5,
	PE14_FMC_D11 = 12,
	PE14_LCD_CLK = 14,
	PE14_EVENTOUT = 15,

	PE15_TIM1_BKIN = 1,
	PE15_FMC_D12 = 12,
	PE15_LCD_R7 = 14,
	PE15_EVENTOUT = 15,

	PF0_I2C2_SDA = 4,
	PF0_FMC_A0 = 12,
	PF0_EVENTOUT = 15,

	PF1_I2C2_SCL = 4,
	PF1_FMC_A1 = 12,
	PF1_EVENTOUT = 15,

	PF2_I2C2_SMBA = 4,
	PF2_FMC_A2 = 12,
	PF2_EVENTOUT = 15,

	PF3_FMC_A3 = 12,
	PF3_EVENTOUT = 15,

	PF4_FMC_A4 = 12,
	PF4_EVENTOUT = 15,

	PF5_FMC_A5 = 12,
	PF5_EVENTOUT = 15,

	PF6_TIM10_CH1 = 3,
	PF6_SPI5_NSS = 5,
	PF6_SAI1_SD_B = 6,
	PF6_UART7_RX = 8,
	PF6_FMC_NIORD = 12,
	PF6_EVENTOUT = 15,

	PF7_TIM11_CH1 = 3,
	PF7_SPI5_SCK = 5,
	PF7_SAI1_MCLK_B = 6,
	PF7_UART7_TX = 8,
	PF7_FMC_NREG = 12,
	PF7_EVENTOUT = 15,

	PF8_SPI5_MISO = 5,
	PF8_SAI1_SCK_B = 6,
	PF8_TIM13_CH1 = 9,
	PF8_FMC_NIOWR = 12,
	PF8_EVENTOUT = 15,

	PF9_SPI5_MOSI = 5,
	PF9_SAI1_FS_B = 6,
	PF9_TIM14_CH1 = 9,
	PF9_FMC_CD = 12,
	PF9_EVENTOUT = 15,

	PF10_FMC_INTR = 12,
	PF10_DCMI_D11 = 13,
	PF10_LCD_DE = 14,
	PF10_EVENTOUT = 15,

	PF11_SPI5_MOSI = 5,
	PF11_FMC_SDNRAS = 12,
	PF11_DCMI_D12 = 13,
	PF11_EVENTOUT = 15,

	PF12_FMC_A6 = 12,
	PF12_EVENTOUT = 15,

	PF13_FMC_A7 = 12,
	PF13_EVENTOUT = 15,

	PF14_FMC_A8 = 12,
	PF14_EVENTOUT = 15,

	PF15_FMC_A9 = 12,
	PF15_EVENTOUT = 15,

	PG0_FMC_A10 = 12,
	PG0_EVENTOUT = 15,

	PG1_FMC_A11 = 12,
	PG1_EVENTOUT = 15,

	PG2_FMC_A12 = 12,
	PG2_EVENTOUT = 15,

	PG3_FMC_A13 = 12,
	PG3_EVENTOUT = 15,

	PG4_FMC_A14 = 12,
	PG4_FMC_BA0 = 12,
	PG4_EVENTOUT = 15,

	PG5_FMC_A15 = 12,
	PG5_FMC_BA1 = 12,
	PG5_EVENTOUT = 15,
	
	PG6_FMC_INT2 = 12,
	PG6_DCMI_D12 = 13,
	PG6_LCD_R7 = 14,
	PG6_EVENTOUT = 15,

	PG7_USART6_CK = 8,
	PG7_FMC_INT3 = 12,
	PG7_DCMI_D13 = 13,
	PG7_LCD_CLK = 14,
	PG7_EVENTOUT = 15,
	
	PG8_SPI6_NSS = 5,
	PG8_SPDIFRX_IN2 = 7,
	PG8_USART6_RTS = 8,
	PG8_ETH_PPS_OUT = 11,
	PG8_FMC_SDCLK = 12,
	PG8_EVENTOUT = 15,

	PG9_SPDIFRX_IN3 = 7,
	PG9_USART6_RX = 8,
	PG9_QUADSPI_BK2_IO2 = 9,
	PG9_SAI2_FS_B = 10,
	PG9_FMC_NE2 = 12,
	PG9_FMC_NCE3 = 12,
	PG9_DCMI_VSYNC = 13,
	PG9_EVENTOUT = 15,

	PG10_LCD_G3 = 9,
	PG10_SAI2_SD_B = 10,
	PG10_FMC_NCE4_1 = 12,
	PG10_FMC_NE3 = 12,
	PG10_DCMI_D2 = 13,
	PG10_LCD_B2 = 14,
	PG10_EVENTOUT = 15,

	PG11_ETH_MII_TX_EN = 11,
	PG11_ETH_RMII_TX_EN = 11,
	PG11_FMC_NCE4_2 = 12,
	PG11_DCMI_D3 = 13,
	PG11_LCD_B3 = 14,
	PG11_EVENTOUT = 15,

	PG12_SPI6_MISO = 5,
	PG12_USART6_RTS = 8,
	PG12_LCD_B4 = 9,
	PG12_FMC_NE4 = 12,
	PG12_LCD_B1 = 14,
	PG12_EVENTOUT = 15,

	PG13_SPI6_SCK = 5,
	PG13_USART6_CTS = 8,
	PG13_ETH_MII_TXD0 = 11,
	PG13_ETH_RMII_TXD0 = 11,
	PG13_FMC_A24 = 12,
	PG13_EVENTOUT = 15,

	PG14_SPI6_MOSI = 5,
	PG14_USART6_TX = 8,
	PG14_ETH_MII_TXD1 = 11,
	PG14_ETH_RMII_TXD1 = 11,
	PG14_FMC_A25 = 12,
	PG14_EVENTOUT = 15,

	PG15_USART6_CTS = 8,
	PG15_FMC_SDNCAS = 12,
	PG15_DCMI_D13 = 13,
	PG15_EVENTOUT = 15,

	PH0_EVENTOUT = 15,

	PH1_EVENTOUT = 15,

	PH2_ETH_MII_CRS = 11,
	PH2_FMC_SDCKE0 = 12,
	PH2_LCD_R0 = 14,
	PH2_EVENTOUT = 15,

	PH3_ETH_MII_COL = 11,
	PH3_FMC_SDNE0 = 12,
	PH3_LCD_R1 = 14,
	PH3_EVENTOUT = 15,
	
	PH4_I2C2_SCL = 4,
	PH4_OTG_HS_ULPI_NXT = 10,
	PH4_EVENTOUT = 15,

	PH5_I2C2_SDA = 4,
	PH5_SPI5_NSS = 5,
	PH5_FMC_SDNWE = 12,
	PH5_EVENTOUT = 15,

	PH6_I2C2_SMBA = 4,
	PH6_SPI5_SCK = 5,
	PH6_TIM12_CH1 = 9,
	PH6_FMC_SDNE1 = 12,
	PH6_DCMI_D8 = 13,

	PH7_I2C3_SCL = 4,
	PH7_SPI5_MISO = 5,
	PH7_ETH_MII_RXD3 = 11,
	PH7_SDCKE1 = 12,
	PH7_DCMI_D9 = 13,

	PH8_I2C3_SDA = 4,
	PH8_FMC_D16 = 12,
	PH8_DCMI_HSYNC = 13,
	PH8_LCD_R2 = 14,
	PH8_EVENTOUT = 15,

	PH9_I2C3_SMBA = 4,
	PH9_TIM12_CH2 = 9,
	PH9_FMC_D17 = 12,
	PH9_DCMI_D0 = 13,
	PH9_LCD_R3 = 14,
	PH9_EVENTOUT = 15,

	PH10_TIM5_CH1 = 2,
	PH10_FMC_D18 = 12,
	PH10_DCMI_D1 = 13,
	PH10_LCD_R4 = 14,
	PH10_EVENTOUT = 15,

	PH11_TIM5_CH2 = 2,
	PH11_FMC_D19 = 12,
	PH11_DCMI_D2 = 13,
	PH11_LCD_R5 = 14,
	PH11_EVENTOUT = 15,

	PH12_TIM5_CH3 = 2,
	PH12_FMC_D20 = 12,
	PH12_DCMI_D3 = 13,
	PH12_LCD_R6 = 14,
	PH12_EVENTOUT = 15,

	PH13_TIM8_CH1N = 3,
	PH13_CAN1_TX = 9,
	PH13_FMC_D21 = 12,
	PH13_LCD_G2 = 14,
	PH13_EVENTOUT = 15,

	PH14_TIM8_CH2N = 3,
	PH14_FMC_D22 = 12,
	PH14_DCMI_D4 = 13,
	PH14_LCD_G3 = 14,
	PH14_EVENTOUT = 15,

	PH15_TIM8_CH3N = 3,
	PH15_FMC_D23 = 12,
	PH15_DCMI_D11 = 13,
	PH15_LCD_G4 = 14,
	PH15_EVENTOUT = 15,

	PI0_TIM5_CH4 = 2,
	PI0_SPI2_NSS = 5,
	PI0_I2S2_WS = 5,
	PI0_FMC_D24 = 12,
	PI0_DCMI_D13 = 13,
	PI0_LCD_G5 = 14,
	PI0_EVENTOUT = 15,

	PI1_SPI2_SCK = 5,
	PI1_I2S2_CK = 5,
	PI1_FMC_D25 = 12,
	PI1_DCMI_D8 = 13,
	PI1_LCD_G6 = 14,
	PI1_EVENTOUT = 15,

	PI2_TIM8_CH4 = 3,
	PI2_SPI2_MISO = 5,
	PI2_I2S2_EXT_SD = 6,
	PI2_FMC_D26 = 12,
	PI2_DCMI_D9 = 13,
	PI2_LCD_G7 = 14,
	PI2_EVENTOUT = 15,

